app/views/articles/index.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 1]]
---
      </p>
      <span class= "ml-3 "><%= pluralize(article.votes.count, 'like') %></span>