app/views/articles/show.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 3]]
---

  <span ><%= pluralize(@article.votes.count, 'like') %></span>