app/controllers/articles_controller.rb

SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."article_id" = ? LIMIT ?  [["user_id", 2], ["article_id", 11], ["LIMIT", 1]]
---
  def show
    @vote = current_user.votes.find_by(article_id: @article.id) if current_user

INSERT INTO "articles" ("creator_id", "title", "text", "image", "created_at", "updated_at", "category_id", "prix_max") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)
    @article.creator = current_user
    if @article.save

UPDATE "articles" SET "image" = ?, "updated_at" = ?, "prix_max" = ? WHERE "articles"."id" = ?  [["image", "volkswagen-golf-8-2-615x410.jpg"], ["updated_at", "2023-05-06 02:04:45.072356"], ["prix_max", 34444.0], ["id", 1]]
---
  def update
    if @article.update(article_params)