app/controllers/users_controller.rb

  def show
    @user = User.includes(:articles).find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "email", "password") VALUES (?, ?, ?, ?, ?)  [["username", "jebbar"], ["created_at", "2023-05-09 20:21:52.977355"], ["updated_at", "2023-05-09 20:21:52.977355"], ["email", "jebbar123@gmail.com"], ["password", "jebbar"]]