app/models/article.rb

SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 1]]
---
  def self.best_voted_article
    Article.all.max_by { |a| a.votes.count }