app/views/categories/index.html.erb

<div class="home-articles-container">
  <% Category.all.each do |category|%>
    <% most_recent_article = category.articles.last %>
---
SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY "articles"."id" DESC LIMIT ?  [["category_id", 1], ["LIMIT", 1]]