app/views/categories/show.html.erb

        <p class="article-price">Prix : <%= number_to_currency(article.prix_max)%></p>
        <%= pluralize(article.votes.count, 'like') %>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 3]]